IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP0_CONTROLSS_ECAP0.xml
	<register id="CONTROLSS_ECAP0_ECFRC" acronym="CONTROLSS_ECAP0_ECFRC" offset="0x32" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Writing '1' sets MUNIT_2_ERROR_EVT2 interrupt flag" range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Writing '1' sets MUNIT_2_ERROR_EVT1 interrupt flag" range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Writing '1' sets MUNIT_1_ERROR_EVT2 interrupt flag" range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Writing '1' sets MUNIT_1_ERROR_EVT1 interrupt flag" range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error Force interrupt    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CTR_CMPWriting a 1 sets the CTR_CMP flag.  " range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_CMP" width="1" begin="7" end="7" resetval="0x0" description="Force Counter Equal Compare Interrupt.  This event is only active in APWM mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CTR_CMPWriting a 1 sets the CTR_CMP flag.  " range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_PRD" width="1" begin="6" end="6" resetval="0x0" description="Force Counter Equal Period Interrupt.  This event is only active in APWM mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_CLEARS_CTR_PRDWriting a 1 sets the CTR_PRD flag.  " range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Force Counter Overflow    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CTROVFWriting a 1 to this bit sets the CTROVF flag.  " range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Force Capture Event 4.  This event is only active in CAP mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CEVT4Writing a 1 sets the CEVT4 flag.  " range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Force Capture Event 3.  This event is only active in CAP mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CEVT3Writing a 1 sets the CEVT3 flag.  " range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Force Capture Event 2.  This event is only active in CAP mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CEVT2Writing a 1 sets the CEVT2 flag.  " range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Force Capture Event 1. This event is only active in CAP mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CEVT1Sets the CEVT1 flag.  " range="1" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ECAP0_ECAPSYNCINSEL" acronym="CONTROLSS_ECAP0_ECAPSYNCINSEL" offset="0x3C" width="32" description="">
		<bitfield id="SEL" width="7" begin="6" end="0" resetval="0x1" description="These bits determines the source of SYNCIN signal. 0x0 : Disabled using SOC tieoff. 0x7F : Refer to SOC spec for details." range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP0_HRCTL" acronym="CONTROLSS_ECAP0_HRCTL" offset="0x40" width="32" description="">
		<bitfield id="CALIBCONT" width="1" begin="5" end="5" resetval="0x0" description="Continuous mode Calibration Select Bit: 0 Continuous mode disabled. 1 Continuous mode enabled. Calibration automatically restarts at end of current calibration cycle." range="5" rwaccess="RW"/> 
		<bitfield id="CALIBSTS" width="1" begin="4" end="4" resetval="0x0" description="Calibration status  Bit: 0 No active calibration cycle 1 Calibration cycle in progress" range="4" rwaccess="RO"/> 
		<bitfield id="CALIBSTART" width="1" begin="3" end="3" resetval="0x0" description="Calibration start  Bit: 0 No effect 1 Starts the calibration cycle" range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PRDSEL" width="1" begin="2" end="2" resetval="0x0" description="Calibration Period Match Select Bit: 0 Use SYSCLK Counter For Period Match (default at reset) 1 Reserved" range="2" rwaccess="RW"/> 
		<bitfield id="HRCLKE" width="1" begin="1" end="1" resetval="0x0" description="High Resolution Clock Enable Bit: 0 High resolution clock disabled (default at reset) 1 High resolution clock enabled. The clock should be enabled before enabling the high res function via the HRE bit." range="1" rwaccess="RW"/> 
		<bitfield id="HRE" width="1" begin="0" end="0" resetval="0x0" description="High Resolution Enable Bit: 0 High resolution mode disabled (default at reset) 1 High resolution mode enabled. Enabling this mode will connect the capture registers and edge event modes of the ECAP to be accessed by the High Res function.  Note: The High Res clock needs to be enabled (using the HRCLKE bit) first before enabling the module. Allow a certain start up stabilization period before enabling the module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP0_HRINTEN" acronym="CONTROLSS_ECAP0_HRINTEN" offset="0x48" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Calibration Period Check status Interrupt Enable:  0 Disable Calibration Period Check interrupt status 1 Enable Calibration Period Check interrupt status" range="2" rwaccess="RW"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Calibration done Interrupt Enable:  0 Disable Calibration done Interrupt  1 Enable Calibration done Interrupt" range="1" rwaccess="RW"/>
	</register>
